Repository: rafaelortizzableh/weather_app
Catalog: lib/core/localization/app_*.arb
Languages: it

source: Theme
it: Tema

source: Light Theme
it: Tema chiaro

source: System Theme
it: Tema di sistema

source: Dark Theme
it: Tema scuro

# weatherInCity
source: The weather in
it: Il meteo in

# reloadWeather
source: Reload Weather Data
it: Aggiorna le informazioni sul clima

# forecastForNextFiveDays
source: Forecast for the next five days
it: Il meteo nei prossimi giorni

source: No Internet Connection
it: Nessuna connessione internet

# userDidNotGrantLocationPermissions
source: Location permissions are permanently denied, we cannot request permissions.
it: I permessi di localizzazione sono stati revocati permanentemente, non possono essere richiesti di nuovo.

source: Hello
it: Ciao

# requestPermission
source: Grant Location Permission
it: Attiva permesso di localizzazione

# permissionNeeded
source: We need your location in order to show you the weather
it: Abbiamo bisogno della tua posizione per mostrati il meteo

# locationServicesNeeded
source: Location services need to be enabled in order to show you the weather
it: Il servizio di localizzazione deve essere attivato per mostrarti il meteo

source: Close
it: Chuidere

# enableLocationService
source: Enable
it: Attivare
